content/pages/changelog.org
#+TITLE: Change Log
#+DATE: 2023-12-04 16:14:02 +0800
#+OPTIONS: toc:nil num:nil ^:t p:t
#+PROPERTY: SLUG changelog
#+PROPERTY: LANGUAGE en

* 0.22.0
CLOSED: [2025-03-24 一]
Optimized product interaction and improved stability.

1. Recent files and full-text search have been moved to the sidebar. Now these two functions can be accessed directly from the sidebar.
2. Support one-click creation of files and folders from the file list
3. The sorting of the file list supports setting whether folders are prioritized
4. Fixed the problem that inherited tags cannot be displayed when editing tags
5. *scratch* buffer supports the functions of Refile, archiving and adding attachments
6. Capture template supports separate settings for whether to use mini buffer
7. Other details optimization and problem fixes
* 0.21.1
CLOSED: [2025-03-19 三]
Support archiving.

1. Supports both internal archiving (with 'ARCHIVE' tag) and archiving to other files
2. You can set the default archiving action in the settings
3. Supports setting the archiving path, target headline and whether to use datetree
4. Supports setting the context information to be recorded when archiving
5. Supports global archiving settings and inBufferSettings. With inBufferSettings, you can archive tasks in different files to different locations
6. Now you can trigger the archiving action with one click in the editor or agenda view
* 0.20.0
CLOSED: [2025-02-26 三]
1. Implemented interactive visual tag editing
   1. Support group tag
   2. Support mutually exclusive group
   3. Support regular expression tags
2. Support editing to-do status, priority, tag, etc. directly from the agenda view through remote edit
3. Solved the related issues when customizing capture template
4. Solved the crash problem when highlighting code blocks on some mobile phones.
5. Other bug fixes
* 0.19.0
CLOSED: [2025-01-27 一]
- Support latex environment, latex fragment.
- Support org mode entity
- bugfix
* 0.18.0
CLOSED: [2025-01-11 六]
1. Src block supports syntax highlighting. Support most mainstream development languages and highlighting themes.
2. bugfix
* 0.17.1
CLOSED: [2024-12-31 二]
The user interaction design has been greatly optimized. Now it is not only powerful, but also easier to use.

Note that starting from this version, the gesture operation changes to swiping left from the edge of the screen to go backward and close, and swiping left from non-edge to open the navigation drawer. This is because on the one hand it is unified with the standard side slide return gesture of iOS, and on the other hand it can effectively reduce misoperations.

- Fast accessor supports setting whether to automatically activate the search bar
- Fast accessor supports setting file sorting method
- Other bugfix
* 0.17.0
CLOSED: [2024-12-20 五]
The user interaction design has been greatly optimized. Now it is not only powerful, but also easier to use.
* 0.16.0
CLOSED: [2024-12-06 六]
- Supports displaying images in file links and attachments.
- Fixed the problem of not having permission when inserting attachments.
- Fixed some  other issues.
* 0.15.0
CLOSED: [2024-11-29 五]
1. Hyperlinks and attachments
   1. Supports jumping, inserting and editing of internal and external links.
   2. Supports opening, previewing and editing the following types of attachments:
      1. iWork and Microsoft Office documents
      2. Images
      3. Live Photos
      4. Text files
      5. PDFs
      6. Audio and video files
2. Supports folding or expanding headlines by left swiping or double-clicking.
3. Supports going backward by swiping right.

See [[file:../hyperlinks_and_attachments.html][Hyperlinks and attachments]]

* 0.14.1
CLOSED: [2024-11-10 日]
This is a very important version. In this version we have implemented a more modern display of Org mode than in Emacs. Tables and blocks can be layout and rendered independently. In this version, you can easily browse and edit tables and code blocks on your mobile phone without being limited by the screen size of your mobile phone. And this is just the beginning.

1. Supports Org mode’s Visibility Cycling
2. Currently you can switch the collapsed and expanded state of Subtree through TAB key
3. Supports the independent layout of tables and code blocks. You can see the same table effect as in Emacs on your mobile phone without being limited by the screen size. Of course, you can still edit them smoothly.
4. Supports independent layout and rendering of other blocks, you can even nest other blocks within the block
5. Fix other issues.
* 0.13.0
CLOSED: [2024-09-28 六]
1. Slide menu is back.
2. Support floating action button (FAB)
3. Support insert template content
4. Support backward and forward button
5. Multiple user experience improvements.
