pages/changelog.html
<!DOCTYPE html>
<html lang="en">

  <head>
<!-- Google tag (gtag.js) -->
        <meta charset="utf-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge">
        <meta name="viewport" content="width=device-width, initial-scale=1">
	<meta name="robots" content="index,follow">


	<link href="https://metanote-dev.github.io/theme/css/org.css" rel="stylesheet">
        <!-- Bootstrap Core CSS -->
        <link href="https://metanote-dev.github.io/theme/css/bootstrap.min.css" rel="stylesheet">

        <!-- Custom CSS -->
        <link href="https://metanote-dev.github.io/theme/css/clean-blog.css" rel="stylesheet">

        <!-- Code highlight color scheme -->
            <link href="https://metanote-dev.github.io/theme/css/code_blocks/darkly.css" rel="stylesheet">

            <!-- Custom Fonts -->
            <link href="https://metanote-dev.github.io/theme/fontawesome-free-6.4.0-web/css/all.min.css" rel="stylesheet" type="text/css">
        <!-- <link href='http://fonts.googleapis.com/css?family=Lora:400,700,400italic,700italic' rel='stylesheet' type='text/css'> -->
            <!-- <link href='http://fonts.googleapis.com/css?family=Open+Sans:300italic,400italic,600italic,700italic,800italic,400,300,600,700,800' rel='stylesheet' type='text/css'> -->
	        <title>Change Log</title>

    <meta property="og:locale" content="en">
    <meta property="og:site_name" content="Metanote-notes,docs,tasks">
  </head>

<body>

  <!-- Navigation -->
<nav class="navbar navbar-default navbar-fixed-top" role="navigation">
    <div class="container">
        <!-- Brand and toggle get grouped for better mobile display -->
        <div class="navbar-header page-scroll">
            <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://metanote-dev.github.io/">Metanote-notes,docs,tasks</a>
        </div>
        <!-- Collect the nav links, forms, and other content for toggling -->
        <div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
            <ul class="nav navbar-nav navbar-right">  
                        <li><a href="/blog/index.html">Blog</a></li>
                        <li><a href="/pages/faq.html">FAQ</a></li>
                        <li><a href="/pages/changelog.html">ChangeLog</a></li>
                        <li><a href="/archives.html">Archive</a></li>
				<!-- i18n begin -->
<li class="active"><a href="https://metanote-dev.github.io/">English</a></li>
<li><a href="https://metanote-dev.github.io/zh/">中文</a></li>
<!-- i18n end -->
            </ul>
        </div>
        <!-- /.navbar-collapse -->
    </div>
    <!-- /.container -->
</nav>
    <!-- Page Header -->
    <!-- Set your background image for this header on the line below. -->
        <header class="intro-header" style="background-image: url('https://metanote-dev.github.io/theme/images/home-bg.jpg')">
        <div class="container">
          <div class="row">
	    <div class="col-lg-12">
	      <div class="post-heading">
		<h1>Metanote</h1>
		<h3>A text editor designed for writing, maintaining TODO lists, and project planning.</h3>
	      </div>
	    </div>
	  </div>
        </div>
    </header>

    <!-- Main Content -->
    <div class="container">
        <div class="row">
            <div class="col-lg-8 col-lg-offset-2 col-md-10 col-md-offset-1">
<h1>Change Log</h1>
<hr>
    <article>
        
<div id="outline-container-orgb896b85" class="outline-2">
<h2 id="orgb896b85">0.20.0</h2>
<div class="outline-text-2" id="text-orgb896b85">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2025-02-26 Wed]</span></span></p>
<ol class="org-ol">
<li>Implemented interactive visual tag editing
<ol class="org-ol">
<li>Support group tag</li>
<li>Support mutually exclusive group</li>
<li>Support regular expression tags</li>
</ol></li>
<li>Support editing to-do status, priority, tag, etc. directly from the agenda view through remote edit</li>
<li>Solved the related issues when customizing capture template</li>
<li>Solved the crash problem when highlighting code blocks on some mobile phones.</li>
<li>Other bug fixes</li>
</ol>
</div>
</div>
<div id="outline-container-orgb44af79" class="outline-2">
<h2 id="orgb44af79">0.19.0</h2>
<div class="outline-text-2" id="text-orgb44af79">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2025-01-27 Mon]</span></span></p>
<ul class="org-ul">
<li>Support latex environment, latex fragment.</li>
<li>Support org mode entity</li>
<li>bugfix</li>
</ul>
</div>
</div>
<div id="outline-container-org900002d" class="outline-2">
<h2 id="org900002d">0.18.0</h2>
<div class="outline-text-2" id="text-org900002d">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2025-01-11 Sat]</span></span></p>
<ol class="org-ol">
<li>Src block supports syntax highlighting. Support most mainstream development languages and highlighting themes.</li>
<li>bugfix</li>
</ol>
</div>
</div>
<div id="outline-container-orgf59d057" class="outline-2">
<h2 id="orgf59d057">0.17.1</h2>
<div class="outline-text-2" id="text-orgf59d057">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2024-12-31 Tue]</span></span></p>
<p>
The user interaction design has been greatly optimized. Now it is not only powerful, but also easier to use.
</p>

<p>
Note that starting from this version, the gesture operation changes to swiping left from the edge of the screen to go backward and close, and swiping left from non-edge to open the navigation drawer. This is because on the one hand it is unified with the standard side slide return gesture of iOS, and on the other hand it can effectively reduce misoperations.
</p>

<ul class="org-ul">
<li>Fast accessor supports setting whether to automatically activate the search bar</li>
<li>Fast accessor supports setting file sorting method</li>
<li>Other bugfix</li>
</ul>
</div>
</div>
<div id="outline-container-orge6b8cdb" class="outline-2">
<h2 id="orge6b8cdb">0.17.0</h2>
<div class="outline-text-2" id="text-orge6b8cdb">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2024-12-20 Fri]</span></span></p>
<p>
The user interaction design has been greatly optimized. Now it is not only powerful, but also easier to use.
</p>
</div>
</div>
<div id="outline-container-org8b63866" class="outline-2">
<h2 id="org8b63866">0.16.0</h2>
<div class="outline-text-2" id="text-org8b63866">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2024-12-06 Fri]</span></span></p>
<ul class="org-ul">
<li>Supports displaying images in file links and attachments.</li>
<li>Fixed the problem of not having permission when inserting attachments.</li>
<li>Fixed some  other issues.</li>
</ul>
</div>
</div>
<div id="outline-container-orgfb8613b" class="outline-2">
<h2 id="orgfb8613b">0.15.0</h2>
<div class="outline-text-2" id="text-orgfb8613b">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2024-11-29 Fri]</span></span></p>
<ol class="org-ol">
<li>Hyperlinks and attachments
<ol class="org-ol">
<li>Supports jumping, inserting and editing of internal and external links.</li>
<li>Supports opening, previewing and editing the following types of attachments:
<ol class="org-ol">
<li>iWork and Microsoft Office documents</li>
<li>Images</li>
<li>Live Photos</li>
<li>Text files</li>
<li>PDFs</li>
<li>Audio and video files</li>
</ol></li>
</ol></li>
<li>Supports folding or expanding headlines by left swiping or double-clicking.</li>
<li>Supports going backward by swiping right.</li>
</ol>

<p>
See <a href="../hyperlinks_and_attachments.html">Hyperlinks and attachments</a>
</p>
</div>
</div>

<div id="outline-container-org73a7277" class="outline-2">
<h2 id="org73a7277">0.14.1</h2>
<div class="outline-text-2" id="text-org73a7277">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2024-11-10 Sun]</span></span></p>
<p>
This is a very important version. In this version we have implemented a more modern display of Org mode than in Emacs. Tables and blocks can be layout and rendered independently. In this version, you can easily browse and edit tables and code blocks on your mobile phone without being limited by the screen size of your mobile phone. And this is just the beginning.
</p>

<ol class="org-ol">
<li>Supports Org mode’s Visibility Cycling</li>
<li>Currently you can switch the collapsed and expanded state of Subtree through TAB key</li>
<li>Supports the independent layout of tables and code blocks. You can see the same table effect as in Emacs on your mobile phone without being limited by the screen size. Of course, you can still edit them smoothly.</li>
<li>Supports independent layout and rendering of other blocks, you can even nest other blocks within the block</li>
<li>Fix other issues.</li>
</ol>
</div>
</div>
<div id="outline-container-orga210d76" class="outline-2">
<h2 id="orga210d76">0.13.0</h2>
<div class="outline-text-2" id="text-orga210d76">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2024-09-28 Sat]</span></span></p>
<ol class="org-ol">
<li>Slide menu is back.</li>
<li>Support floating action button (FAB)</li>
<li>Support insert template content</li>
<li>Support backward and forward button</li>
<li>Multiple user experience improvements.</li>
</ol>
</div>
</div>
