content/pages/changelog.org
* 0.12.1
CLOSED: [2024-06-28 五]
1. Confirmation is required before clearing the scratch buffer.
2. The start page can be set to a specific file or folder and cannot be closed.
3. Optimized the display of the settings page.
4. The initial path when opening a file is set to the root directory of the default location.
5. New file content templates are now set independently instead of using capture templates.
6. Agenda view supports swipe gestures to change status.
7. Agenda view now supports displaying category, tags, and priority.
* 0.12.0
CLOSED: [2024-06-25 二]
We continuously explore ways to optimize Metanote through practical use, and this latest upgrade might be the best experience yet. Our developers have started using Metanote heavily in their daily development work to record and manage progress. With thousands of org documents seamlessly integrated with Emacs and real-time synchronization, Metanote has become as essential to us as Emacs. We have shared on our official website how to synchronize with Emacs in real-time and some practical use cases of how we use Metanote daily for your reference.

This update includes:
1. Overall optimization of interaction and interface.
2. Support for directly opening external files.
3. Support for *scratch* buffer.
4. Editor support for adjusting font size.
5. Editor support for auto-hiding and displaying the navigation bar and toolbar.
6. Performance optimization for full-text search.
7. Newest added headlines in the agenda view and todo list will be listed at the top.
8. Opening content in the agenda and task list will automatically narrow to specific subtree.
9. Narrow buffer now supports widen.
10. Optimization of buffer list management.

* 0.11.0
CLOSED: <2024-04-24 三>
Major update: Sync support is now available.

Metanote supports various sync methods to seamlessly connect your documents between your computer and iPhone. You can configure sync in the settings, including local directories, Git, iCloud, Dropbox, OneDrive, WebDAV (Apache WebDAV Server, ownCloud, Yandex.disk, etc.). Local directories, Git, and iCloud are implemented by adding external folders, while other methods have built-in sync. Sync is fully automatic, and you hardly need to trigger it actively. In most cases, when you need it, your latest files are already there. You can use Metanote as a data center, syncing with different directories and different cloud services, or syncing with multiple cloud services on the same directory. Feel free to explore more ways to use it.

* 0.10.1
CLOSED: <2024-04-08 一>
1. Fixed issues after upgrading to iOS 17.4.1.
2. Fixed issues on iOS 14.x.
3. Fixed other user-reported issues.
* 0.10.0
CLOSED: <2024-03-26 二>
1. Automatic updates for agenda views and to-do list are now supported. Whether you edit files in Metanote or use other app to edit files in external folders, or retrieve updates from iCloud or Git, Metanote can now automatically detect changes to files and update them accordingly. Your content will always stay up to date.
2. Agenda Filter support is now available, allowing you to filter schedules and to-do items directly by category, todo keyword, and tag.
3. Buffer outlines now support clicking to jump to a specific headline.
4. Customization of Todo Keyword icons and colors is now possible.
5. More intuitive and convenient multi-buffer management is now provided. You can now directly switch buffers from the Buffer list.
6. Various other optimizations have been made, resulting in increased stability.

   
Regarding file synchronization, Metanote can add any external directory that supports folder-level File Provider and automatically detect file updates. Unfortunately, many cloud drives only support file-level File Provider. We have implemented the ability to add individual files to Metanote, which is still in testing and is expected to be launched in next version. Therefore, the best regular file synchronization solutions for now are:
1. iCloud, which supports folder-level File Provider and can be directly added to Metanote.
2. Git, where most Git app's directories can be directly added to Metanote. For example, with PolyGit, when you git pull, Metanote will automatically update the file content.
3. Other apps that support synchronization. Most document editing apps can be directly added to Metanote, such as Obsidian and Logseq. When files in these apps are updated, Metanote will automatically handle the edited files.
* 0.9.0
CLOSED: <2024-02-19 一>
Refreshed and revamped!
1. Redesigned the logo.
2. Completely optimized the main interactive experience, supporting sidebars and more mobile-friendly swipe actions for efficient and smooth use.
3. Focused on optimizing the keyboard design:
   - Features are centralized and clear.
   - Added support for sound feedback.
   - Enabled cursor movement with the joystick.
4. Added support for hiding files and folders.
5. Added the ability to add working directories for Obsidian and Logseq, integrating and managing them uniformly.
6. Supported customization of the startup page.
7. Enabled opening the current content in a new tab.
8. Various detailed optimizations and bug fixes.
