pages/changelog.html
<div id="outline-container-org91a4f21" class="outline-2">
<h2 id="org91a4f21">0.12.1</h2>
<div class="outline-text-2" id="text-org91a4f21">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2024-06-28 Fri]</span></span></p>
<ol class="org-ol">
<li>Confirmation is required before clearing the scratch buffer.</li>
<li>The start page can be set to a specific file or folder and cannot be closed.</li>
<li>Optimized the display of the settings page.</li>
<li>The initial path when opening a file is set to the root directory of the default location.</li>
<li>New file content templates are now set independently instead of using capture templates.</li>
<li>Agenda view supports swipe gestures to change status.</li>
<li>Agenda view now supports displaying category, tags, and priority.</li>
</ol>
</div>
</div>
<div id="outline-container-org4899ace" class="outline-2">
<h2 id="org4899ace">0.12.0</h2>
<div class="outline-text-2" id="text-org4899ace">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">[2024-06-25 Tue]</span></span></p>
<p>
We continuously explore ways to optimize Metanote through practical use, and this latest upgrade might be the best experience yet. Our developers have started using Metanote heavily in their daily development work to record and manage progress. With thousands of org documents seamlessly integrated with Emacs and real-time synchronization, Metanote has become as essential to us as Emacs. We have shared on our official website how to synchronize with Emacs in real-time and some practical use cases of how we use Metanote daily for your reference.
</p>

<p>
This update includes:
</p>
<ol class="org-ol">
<li>Overall optimization of interaction and interface.</li>
<li>Support for directly opening external files.</li>
<li>Support for <b>scratch</b> buffer.</li>
<li>Editor support for adjusting font size.</li>
<li>Editor support for auto-hiding and displaying the navigation bar and toolbar.</li>
<li>Performance optimization for full-text search.</li>
<li>Newest added headlines in the agenda view and todo list will be listed at the top.</li>
<li>Opening content in the agenda and task list will automatically narrow to specific subtree.</li>
<li>Narrow buffer now supports widen.</li>
<li>Optimization of buffer list management.</li>
</ol>
</div>
</div>

<div id="outline-container-orgacf791e" class="outline-2">
<h2 id="orgacf791e">0.11.0</h2>
<div class="outline-text-2" id="text-orgacf791e">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">&lt;2024-04-24 Wed&gt;</span></span></p>
<p>
Major update: Sync support is now available.
</p>

<p>
Metanote supports various sync methods to seamlessly connect your documents between your computer and iPhone. You can configure sync in the settings, including local directories, Git, iCloud, Dropbox, OneDrive, WebDAV (Apache WebDAV Server, ownCloud, Yandex.disk, etc.). Local directories, Git, and iCloud are implemented by adding external folders, while other methods have built-in sync. Sync is fully automatic, and you hardly need to trigger it actively. In most cases, when you need it, your latest files are already there. You can use Metanote as a data center, syncing with different directories and different cloud services, or syncing with multiple cloud services on the same directory. Feel free to explore more ways to use it.
</p>
</div>
</div>

<div id="outline-container-org7bb8c86" class="outline-2">
<h2 id="org7bb8c86">0.10.1</h2>
<div class="outline-text-2" id="text-org7bb8c86">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">&lt;2024-04-08 Mon&gt;</span></span></p>
<ol class="org-ol">
<li>Fixed issues after upgrading to iOS 17.4.1.</li>
<li>Fixed issues on iOS 14.x.</li>
<li>Fixed other user-reported issues.</li>
</ol>
</div>
</div>
<div id="outline-container-org9a67d16" class="outline-2">
<h2 id="org9a67d16">0.10.0</h2>
<div class="outline-text-2" id="text-org9a67d16">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">&lt;2024-03-26 Tue&gt;</span></span></p>
<ol class="org-ol">
<li>Automatic updates for agenda views and to-do list are now supported. Whether you edit files in Metanote or use other app to edit files in external folders, or retrieve updates from iCloud or Git, Metanote can now automatically detect changes to files and update them accordingly. Your content will always stay up to date.</li>
<li>Agenda Filter support is now available, allowing you to filter schedules and to-do items directly by category, todo keyword, and tag.</li>
<li>Buffer outlines now support clicking to jump to a specific headline.</li>
<li>Customization of Todo Keyword icons and colors is now possible.</li>
<li>More intuitive and convenient multi-buffer management is now provided. You can now directly switch buffers from the Buffer list.</li>
<li>Various other optimizations have been made, resulting in increased stability.</li>
</ol>


<p>
Regarding file synchronization, Metanote can add any external directory that supports folder-level File Provider and automatically detect file updates. Unfortunately, many cloud drives only support file-level File Provider. We have implemented the ability to add individual files to Metanote, which is still in testing and is expected to be launched in next version. Therefore, the best regular file synchronization solutions for now are:
</p>
<ol class="org-ol">
<li>iCloud, which supports folder-level File Provider and can be directly added to Metanote.</li>
<li>Git, where most Git app's directories can be directly added to Metanote. For example, with PolyGit, when you git pull, Metanote will automatically update the file content.</li>
<li>Other apps that support synchronization. Most document editing apps can be directly added to Metanote, such as Obsidian and Logseq. When files in these apps are updated, Metanote will automatically handle the edited files.</li>
</ol>
</div>
</div>
<div id="outline-container-org1992c4d" class="outline-2">
<h2 id="org1992c4d">0.9.0</h2>
<div class="outline-text-2" id="text-org1992c4d">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">&lt;2024-02-19 Mon&gt;</span></span></p>
<p>
Refreshed and revamped!
</p>
<ol class="org-ol">
<li>Redesigned the logo.</li>
<li>Completely optimized the main interactive experience, supporting sidebars and more mobile-friendly swipe actions for efficient and smooth use.</li>
<li>Focused on optimizing the keyboard design:
<ul class="org-ul">
<li>Features are centralized and clear.</li>
<li>Added support for sound feedback.</li>
<li>Enabled cursor movement with the joystick.</li>
</ul></li>
<li>Added support for hiding files and folders.</li>
<li>Added the ability to add working directories for Obsidian and Logseq, integrating and managing them uniformly.</li>
<li>Supported customization of the startup page.</li>
<li>Enabled opening the current content in a new tab.</li>
<li>Various detailed optimizations and bug fixes.</li>
</ol>
</div>
</div>
