pages/changelog.html
<div id="outline-container-org86bdbfd" class="outline-2">
<h2 id="org86bdbfd">0.8.0</h2>
<div class="outline-text-2" id="text-org86bdbfd">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">&lt;2024-02-01 Thu&gt;</span></span></p>
<p>
Finally, the development and testing of the custom Capture feature are complete! This process not only presented some technical challenges but also involved a substantial amount of work. There are many usage scenarios to support, and the testing alone took nearly two weeks.
</p>

<p>
With this, Metanote's support for the core features of Org mode is more comprehensive, including basic document structure, custom task management, custom InBufferSettings like tags, Agenda views, custom Capture, and more. I believe Metanote is now one of the most complete applications supporting Org mode outside of Emacs. In future development, we will gradually introduce support for rich text rendering, including images, tables, hyperlinks, encryption, export functions, Roam Research, and more. Stay tuned.
</p>

<p>
At the same time, we've initiated the public beta version. You can install both the official and beta versions at same time, join the public test, and provide feedback. <a href="https://testflight.apple.com/join/pAYGdOQe">https://testflight.apple.com/join/pAYGdOQe</a> , Please note that the beta version may have some bugs and is intended for testing purposes only.
</p>

<p>
Updates in this release:
</p>
<ol class="org-ol">
<li>Added support for custom Capture feature. For detailed settings and usage, please refer to the official website: <a href="https://metanote-dev.github.io/">https://metanote-dev.github.io/</a></li>
<li>Moved all functions that open new buffers, including capture, agenda view, file manager, favorites, etc., to the left menu in the navigation bar.</li>
<li>The 'Drafts' feature, now functioning as a Capture template, is no longer independent and has been removed from the file manager.</li>
<li>The 'Favorites' feature is now a separate buffer and has been removed from the file manager.</li>
<li>Optimized the functions of the MiniBuffer and Narrow Buffer.</li>
</ol>
</div>
</div>
<div id="outline-container-org2726c93" class="outline-2">
<h2 id="org2726c93">0.7.1</h2>
<div class="outline-text-2" id="text-org2726c93">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">&lt;2023-12-11 Mon&gt;</span></span></p>
<ol class="org-ol">
<li>Fixed the issue where custom Agenda views of the Agenda type could not be deleted.</li>
<li>Fixed the issue where there were two “Settings” entries in the menu.</li>
</ol>
</div>
</div>
<div id="outline-container-orgc43e4b6" class="outline-2">
<h2 id="orgc43e4b6">0.7.0</h2>
<div class="outline-text-2" id="text-orgc43e4b6">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">&lt;2023-11-18 Sat&gt;</span></span></p>
<p>
By now, we support all the settings for the custom agenda view feature in Org mode. If you find any omissions, please report the issues to us.
</p>

<p>
Next step, we will support the "Custom capture" feature. Stay tuned!
</p>

<ol class="org-ol">
<li>Custom agenda view now supports agenda types, allowing you to view to-do items by day, week, month, and year.</li>
<li>Custom agenda views can now be saved directly from agenda view.</li>
<li>Agenda view defaults to displaying all to-do items for the current week.</li>
<li>The default global to-do list only shows incomplete items.</li>
<li>The entry points for Capture and Agenda View have been unified into the More menu.</li>
<li>Various details and user experience optimizations have been implemented.</li>
</ol>
</div>
</div>
<div id="outline-container-org282faa3" class="outline-2">
<h2 id="org282faa3">0.6.0</h2>
<div class="outline-text-2" id="text-org282faa3">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">&lt;2023-11-03 Fri&gt;</span></span></p>
<p>
Exciting features! Now supporting custom agenda views! You can customize your to-do lists based on CATEGORY, TAG, PROPERTY, TODO keywords, etc., and save them for easy access and review.
</p>

<ol class="org-ol">
<li>Customizable agenda views supported</li>
<li>Support for Tags, including Tag Groups, refer to the help documentation for details</li>
<li>Support for Properties, including custom Properties and Special Properties. Currently supported Special Properties include PRIORITY, LEVEL, TODO, ITEM, CATEGORY. Refer to the help documentation for details.</li>
<li>Support for InBufferSettings, refer to the documentation. Currently supported settings include TITLE, DATE, CATEGORY, PROPERTY, TODO, SEQ<sub>TODO</sub>, TYP<sub>TODO</sub>, FILETAGS, TAGS.</li>
<li>Window switching effects optimized, along with multiple user experience enhancements.</li>
</ol>
</div>
</div>
<div id="outline-container-org436e536" class="outline-2">
<h2 id="org436e536">0.5.0</h2>
<div class="outline-text-2" id="text-org436e536">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">&lt;2023-09-22 Fri&gt;</span></span></p>
<p>
Metanote is currently in a fast-paced development phase, and as we progress with our development work, we will bring more convenient and useful features, aiming to become the best note, calendar, and to-do list tool. We appreciate the support and encouragement from our early users.
</p>

<ol class="org-ol">
<li>In this version, we have introduced the option to make a one-time purchase for permanent access to all Metanote premium features!</li>
<li>Added support for iPad!</li>
<li>Added support for moving and renaming files or folders, making it easier for you to manage your drafts and flashes.</li>
<li>Multiple user experience improvements and refinements.</li>
</ol>
</div>
</div>
<div id="outline-container-org74090c2" class="outline-2">
<h2 id="org74090c2">0.4.0</h2>
<div class="outline-text-2" id="text-org74090c2">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">&lt;2023-09-08 Fri&gt;</span></span></p>
<p>
Major Update!
Three highly useful features:
</p>
<ol class="org-ol">
<li>Local notifications are now supported! Receive reminders for SCHEDULED, DEADLINE, and ACTIVE planning.</li>
<li>Introducing Today's Agenda View! Easily check what you need to do today with just one tap!</li>
<li>Customize your to-do keywords! Say goodbye to TODO and DONE; you can now set your unique keywords like 'LATER,' 'CANCELED,' or whatever suits your workflow best. Let your imagination run wild!</li>
</ol>

<p>
Experience Improvements:
</p>
<ol class="org-ol">
<li>The screen stays lit while editing, giving you more time to think.</li>
<li>Timestamp editing has been optimized.</li>
<li>Capture from shortcuts!</li>
</ol>

<p>
The app is in its early stages of rapid development, so stay tuned for updates – there are always exciting features coming your way!
</p>
</div>
</div>
<div id="outline-container-orgba017ac" class="outline-2">
<h2 id="orgba017ac">0.3.0</h2>
<div class="outline-text-2" id="text-orgba017ac">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">&lt;2023-08-22 Tue&gt;</span></span></p>
<ol class="org-ol">
<li>Support Drafts! Now your can capture drafts!</li>
<li>a better file browser</li>
<li>Support set default location</li>
<li>move cursor quickly</li>
<li>editor support dark mode and better font color</li>
</ol>
</div>
</div>
<div id="outline-container-org9ec1f59" class="outline-2">
<h2 id="org9ec1f59">0.2.1</h2>
<div class="outline-text-2" id="text-org9ec1f59">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">&lt;2023-08-11 Fri&gt;</span></span></p>
<ol class="org-ol">
<li>bugfix</li>
</ol>
</div>
</div>
<div id="outline-container-org57b12e5" class="outline-2">
<h2 id="org57b12e5">0.2.0</h2>
<div class="outline-text-2" id="text-org57b12e5">
<p><span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED:</span> <span class="timestamp">&lt;2023-08-07 Mon&gt;</span></span></p>
<ol class="org-ol">
<li>Support adding locations! Support iCloud or other file provider.</li>
<li>Support remove auto-fill mode.</li>
<li>bug fix</li>
</ol>
</div>
</div>
